/*
// Вывести индекс определенного числа из массива
int[] array = {1,12,31,4,15,16,17,18};   //зададим массив
int n = array.Length;                    //зададим переменную n и присвоим ей значение равное длине массива
int find = 18;                           //зададим переменную find , то значение , которое нам надо будет найти (какой имеет индекс эта переменная)
int index=0;                             //начальное значение индекса по умолчанию будет считать 0
while(index<n)
{
    if(array[index]==find)               //пусть если значение массива с определенным индексом равно find (нашему значению)
    {
        Console.WriteLine(index);        //выведи мне тогда индекс этой переменной
    }
    index++;                             //если же нет, то прибавь один к индексу и по новой
}
*/

int Max(int arg1, int arg2, int arg3)
{
    
}

